{"weightsManifest": [{"weights": [{"name": "dense_1/kernel", "dtype": "float32", "shape": [50176, 256]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [256]}], "paths": ["group1-shard1of13", "group1-shard2of13", "group1-shard3of13", "group1-shard4of13", "group1-shard5of13", "group1-shard6of13", "group1-shard7of13", "group1-shard8of13", "group1-shard9of13", "group1-shard10of13", "group1-shard11of13", "group1-shard12of13", "group1-shard13of13"]}, {"weights": [{"name": "dense_2/kernel", "dtype": "float32", "shape": [256, 30]}, {"name": "dense_2/bias", "dtype": "float32", "shape": [30]}], "paths": ["group2-shard1of1"]}, {"weights": [{"name": "conv1/kernel", "dtype": "float32", "shape": [3, 3, 3, 32]}, {"name": "conv1_bn/gamma", "dtype": "float32", "shape": [32]}, {"name": "conv1_bn/beta", "dtype": "float32", "shape": [32]}, {"name": "conv1_bn/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "conv1_bn/moving_variance", "dtype": "float32", "shape": [32]}, {"name": "conv_dw_1/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 32, 1]}, {"name": "conv_dw_1_bn/gamma", "dtype": "float32", "shape": [32]}, {"name": "conv_dw_1_bn/beta", "dtype": "float32", "shape": [32]}, {"name": "conv_dw_1_bn/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "conv_dw_1_bn/moving_variance", "dtype": "float32", "shape": [32]}, {"name": "conv_pw_1/kernel", "dtype": "float32", "shape": [1, 1, 32, 64]}, {"name": "conv_pw_1_bn/gamma", "dtype": "float32", "shape": [64]}, {"name": "conv_pw_1_bn/beta", "dtype": "float32", "shape": [64]}, {"name": "conv_pw_1_bn/moving_mean", "dtype": "float32", "shape": [64]}, {"name": "conv_pw_1_bn/moving_variance", "dtype": "float32", "shape": [64]}, {"name": "conv_dw_2/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 64, 1]}, {"name": "conv_dw_2_bn/gamma", "dtype": "float32", "shape": [64]}, {"name": "conv_dw_2_bn/beta", "dtype": "float32", "shape": [64]}, {"name": "conv_dw_2_bn/moving_mean", "dtype": "float32", "shape": [64]}, {"name": "conv_dw_2_bn/moving_variance", "dtype": "float32", "shape": [64]}, {"name": "conv_pw_2/kernel", "dtype": "float32", "shape": [1, 1, 64, 128]}, {"name": "conv_pw_2_bn/gamma", "dtype": "float32", "shape": [128]}, {"name": "conv_pw_2_bn/beta", "dtype": "float32", "shape": [128]}, {"name": "conv_pw_2_bn/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "conv_pw_2_bn/moving_variance", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_3/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 128, 1]}, {"name": "conv_dw_3_bn/gamma", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_3_bn/beta", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_3_bn/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_3_bn/moving_variance", "dtype": "float32", "shape": [128]}, {"name": "conv_pw_3/kernel", "dtype": "float32", "shape": [1, 1, 128, 128]}, {"name": "conv_pw_3_bn/gamma", "dtype": "float32", "shape": [128]}, {"name": "conv_pw_3_bn/beta", "dtype": "float32", "shape": [128]}, {"name": "conv_pw_3_bn/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "conv_pw_3_bn/moving_variance", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_4/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 128, 1]}, {"name": "conv_dw_4_bn/gamma", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_4_bn/beta", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_4_bn/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "conv_dw_4_bn/moving_variance", "dtype": "float32", "shape": [128]}, {"name": "conv_pw_4/kernel", "dtype": "float32", "shape": [1, 1, 128, 256]}, {"name": "conv_pw_4_bn/gamma", "dtype": "float32", "shape": [256]}, {"name": "conv_pw_4_bn/beta", "dtype": "float32", "shape": [256]}, {"name": "conv_pw_4_bn/moving_mean", "dtype": "float32", "shape": [256]}, {"name": "conv_pw_4_bn/moving_variance", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_5/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 256, 1]}, {"name": "conv_dw_5_bn/gamma", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_5_bn/beta", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_5_bn/moving_mean", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_5_bn/moving_variance", "dtype": "float32", "shape": [256]}, {"name": "conv_pw_5/kernel", "dtype": "float32", "shape": [1, 1, 256, 256]}, {"name": "conv_pw_5_bn/gamma", "dtype": "float32", "shape": [256]}, {"name": "conv_pw_5_bn/beta", "dtype": "float32", "shape": [256]}, {"name": "conv_pw_5_bn/moving_mean", "dtype": "float32", "shape": [256]}, {"name": "conv_pw_5_bn/moving_variance", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_6/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 256, 1]}, {"name": "conv_dw_6_bn/gamma", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_6_bn/beta", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_6_bn/moving_mean", "dtype": "float32", "shape": [256]}, {"name": "conv_dw_6_bn/moving_variance", "dtype": "float32", "shape": [256]}, {"name": "conv_pw_6/kernel", "dtype": "float32", "shape": [1, 1, 256, 512]}, {"name": "conv_pw_6_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_6_bn/beta", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_6_bn/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_6_bn/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_7/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 512, 1]}, {"name": "conv_dw_7_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_7_bn/beta", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_7_bn/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_7_bn/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_7/kernel", "dtype": "float32", "shape": [1, 1, 512, 512]}, {"name": "conv_pw_7_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_7_bn/beta", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_7_bn/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_7_bn/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_8/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 512, 1]}, {"name": "conv_dw_8_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_8_bn/beta", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_8_bn/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_8_bn/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_8/kernel", "dtype": "float32", "shape": [1, 1, 512, 512]}, {"name": "conv_pw_8_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_8_bn/beta", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_8_bn/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_8_bn/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_9/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 512, 1]}, {"name": "conv_dw_9_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_9_bn/beta", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_9_bn/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_9_bn/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_9/kernel", "dtype": "float32", "shape": [1, 1, 512, 512]}, {"name": "conv_pw_9_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_9_bn/beta", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_9_bn/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_9_bn/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_10/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 512, 1]}, {"name": "conv_dw_10_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_10_bn/beta", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_10_bn/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_10_bn/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_10/kernel", "dtype": "float32", "shape": [1, 1, 512, 512]}, {"name": "conv_pw_10_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_10_bn/beta", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_10_bn/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_10_bn/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_11/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 512, 1]}, {"name": "conv_dw_11_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_11_bn/beta", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_11_bn/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_11_bn/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_11/kernel", "dtype": "float32", "shape": [1, 1, 512, 512]}, {"name": "conv_pw_11_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_11_bn/beta", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_11_bn/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_11_bn/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_12/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 512, 1]}, {"name": "conv_dw_12_bn/gamma", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_12_bn/beta", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_12_bn/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "conv_dw_12_bn/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "conv_pw_12/kernel", "dtype": "float32", "shape": [1, 1, 512, 1024]}, {"name": "conv_pw_12_bn/gamma", "dtype": "float32", "shape": [1024]}, {"name": "conv_pw_12_bn/beta", "dtype": "float32", "shape": [1024]}, {"name": "conv_pw_12_bn/moving_mean", "dtype": "float32", "shape": [1024]}, {"name": "conv_pw_12_bn/moving_variance", "dtype": "float32", "shape": [1024]}, {"name": "conv_dw_13/depthwise_kernel", "dtype": "float32", "shape": [3, 3, 1024, 1]}, {"name": "conv_dw_13_bn/gamma", "dtype": "float32", "shape": [1024]}, {"name": "conv_dw_13_bn/beta", "dtype": "float32", "shape": [1024]}, {"name": "conv_dw_13_bn/moving_mean", "dtype": "float32", "shape": [1024]}, {"name": "conv_dw_13_bn/moving_variance", "dtype": "float32", "shape": [1024]}, {"name": "conv_pw_13/kernel", "dtype": "float32", "shape": [1, 1, 1024, 1024]}, {"name": "conv_pw_13_bn/gamma", "dtype": "float32", "shape": [1024]}, {"name": "conv_pw_13_bn/beta", "dtype": "float32", "shape": [1024]}, {"name": "conv_pw_13_bn/moving_mean", "dtype": "float32", "shape": [1024]}, {"name": "conv_pw_13_bn/moving_variance", "dtype": "float32", "shape": [1024]}], "paths": ["group3-shard1of4", "group3-shard2of4", "group3-shard3of4", "group3-shard4of4"]}], "modelTopology": {"keras_version": "2.0.8", "model_config": {"config": [{"config": {"name": "mobilenet_1.00_224", "layers": [{"name": "input_1", "config": {"batch_input_shape": [null, 224, 224, 3], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv1", "config": {"kernel_constraint": null, "bias_regularizer": null, "strides": [2, 2], "activation": "linear", "data_format": "channels_last", "trainable": false, "filters": 32, "kernel_size": [3, 3], "name": "conv1", "use_bias": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv1_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv1_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv1_relu", "config": {"name": "conv1_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_dw_1", "config": {"depthwise_regularizer": null, "name": "conv_dw_1", "strides": [1, 1], "activation": "linear", "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": false, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "depthwise_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1}, "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_1_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_dw_1_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_dw_1_relu", "config": {"name": "conv_dw_1_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_pw_1", "config": {"kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "data_format": "channels_last", "trainable": false, "filters": 64, "kernel_size": [1, 1], "name": "conv_pw_1", "use_bias": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv_pw_1_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_pw_1_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_pw_1_relu", "config": {"name": "conv_pw_1_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_dw_2", "config": {"depthwise_regularizer": null, "name": "conv_dw_2", "strides": [2, 2], "activation": "linear", "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": false, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "depthwise_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1}, "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_2_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_dw_2_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_dw_2_relu", "config": {"name": "conv_dw_2_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_pw_2", "config": {"kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "data_format": "channels_last", "trainable": false, "filters": 128, "kernel_size": [1, 1], "name": "conv_pw_2", "use_bias": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv_pw_2_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_pw_2_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_pw_2_relu", "config": {"name": "conv_pw_2_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_dw_3", "config": {"depthwise_regularizer": null, "name": "conv_dw_3", "strides": [1, 1], "activation": "linear", "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": false, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "depthwise_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1}, "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_3_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_dw_3_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_dw_3_relu", "config": {"name": "conv_dw_3_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_pw_3", "config": {"kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "data_format": "channels_last", "trainable": false, "filters": 128, "kernel_size": [1, 1], "name": "conv_pw_3", "use_bias": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv_pw_3_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_pw_3_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_pw_3_relu", "config": {"name": "conv_pw_3_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_dw_4", "config": {"depthwise_regularizer": null, "name": "conv_dw_4", "strides": [2, 2], "activation": "linear", "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": false, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "depthwise_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1}, "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_4_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_dw_4_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_dw_4_relu", "config": {"name": "conv_dw_4_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_pw_4", "config": {"kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "data_format": "channels_last", "trainable": false, "filters": 256, "kernel_size": [1, 1], "name": "conv_pw_4", "use_bias": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv_pw_4_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_pw_4_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_pw_4_relu", "config": {"name": "conv_pw_4_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_dw_5", "config": {"depthwise_regularizer": null, "name": "conv_dw_5", "strides": [1, 1], "activation": "linear", "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": false, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "depthwise_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1}, "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_5_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_dw_5_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_dw_5_relu", "config": {"name": "conv_dw_5_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_pw_5", "config": {"kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "data_format": "channels_last", "trainable": false, "filters": 256, "kernel_size": [1, 1], "name": "conv_pw_5", "use_bias": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv_pw_5_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_pw_5_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_pw_5_relu", "config": {"name": "conv_pw_5_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_dw_6", "config": {"depthwise_regularizer": null, "name": "conv_dw_6", "strides": [2, 2], "activation": "linear", "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": false, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "depthwise_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1}, "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_6_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_dw_6_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_dw_6_relu", "config": {"name": "conv_dw_6_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_pw_6", "config": {"kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "data_format": "channels_last", "trainable": false, "filters": 512, "kernel_size": [1, 1], "name": "conv_pw_6", "use_bias": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv_pw_6_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_pw_6_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_pw_6_relu", "config": {"name": "conv_pw_6_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_dw_7", "config": {"depthwise_regularizer": null, "name": "conv_dw_7", "strides": [1, 1], "activation": "linear", "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": false, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "depthwise_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1}, "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_7_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_dw_7_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_dw_7_relu", "config": {"name": "conv_dw_7_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_pw_7", "config": {"kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "data_format": "channels_last", "trainable": false, "filters": 512, "kernel_size": [1, 1], "name": "conv_pw_7", "use_bias": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv_pw_7_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_pw_7_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_pw_7_relu", "config": {"name": "conv_pw_7_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_dw_8", "config": {"depthwise_regularizer": null, "name": "conv_dw_8", "strides": [1, 1], "activation": "linear", "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": false, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "depthwise_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1}, "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_8_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_dw_8_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_dw_8_relu", "config": {"name": "conv_dw_8_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_pw_8", "config": {"kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "data_format": "channels_last", "trainable": false, "filters": 512, "kernel_size": [1, 1], "name": "conv_pw_8", "use_bias": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv_pw_8_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_pw_8_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_pw_8_relu", "config": {"name": "conv_pw_8_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_dw_9", "config": {"depthwise_regularizer": null, "name": "conv_dw_9", "strides": [1, 1], "activation": "linear", "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": false, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "depthwise_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1}, "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_9_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_dw_9_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_dw_9_relu", "config": {"name": "conv_dw_9_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_pw_9", "config": {"kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "data_format": "channels_last", "trainable": false, "filters": 512, "kernel_size": [1, 1], "name": "conv_pw_9", "use_bias": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv_pw_9_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_pw_9_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_pw_9_relu", "config": {"name": "conv_pw_9_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_dw_10", "config": {"depthwise_regularizer": null, "name": "conv_dw_10", "strides": [1, 1], "activation": "linear", "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": false, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "depthwise_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1}, "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_10_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_dw_10_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_dw_10_relu", "config": {"name": "conv_dw_10_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_pw_10", "config": {"kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "data_format": "channels_last", "trainable": false, "filters": 512, "kernel_size": [1, 1], "name": "conv_pw_10", "use_bias": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv_pw_10_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_pw_10_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_pw_10_relu", "config": {"name": "conv_pw_10_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_dw_11", "config": {"depthwise_regularizer": null, "name": "conv_dw_11", "strides": [1, 1], "activation": "linear", "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": false, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "depthwise_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1}, "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_11_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_dw_11_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_dw_11_relu", "config": {"name": "conv_dw_11_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_pw_11", "config": {"kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "data_format": "channels_last", "trainable": false, "filters": 512, "kernel_size": [1, 1], "name": "conv_pw_11", "use_bias": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv_pw_11_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_pw_11_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_pw_11_relu", "config": {"name": "conv_pw_11_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_dw_12", "config": {"depthwise_regularizer": null, "name": "conv_dw_12", "strides": [2, 2], "activation": "linear", "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": false, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "depthwise_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1}, "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_12_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_dw_12_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_dw_12_relu", "config": {"name": "conv_dw_12_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_pw_12", "config": {"kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "data_format": "channels_last", "trainable": false, "filters": 1024, "kernel_size": [1, 1], "name": "conv_pw_12", "use_bias": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv_pw_12_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_pw_12_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_pw_12_relu", "config": {"name": "conv_pw_12_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_dw_13", "config": {"depthwise_regularizer": null, "name": "conv_dw_13", "strides": [1, 1], "activation": "linear", "trainable": false, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": false, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "depthwise_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "depth_multiplier": 1}, "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D"}, {"name": "conv_dw_13_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_dw_13_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "scale": true}, "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "conv_dw_13_relu", "config": {"name": "conv_dw_13_relu", "activation": "relu6", "trainable": false}, "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv_pw_13", "config": {"kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "data_format": "channels_last", "trainable": false, "filters": 1024, "kernel_size": [1, 1], "name": "conv_pw_13", "use_bias": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv_pw_13_bn", "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv_pw_13_bn", "beta_constraint": null, "epsilon": 0.001, "trainable": false, "moving_mean_initializer": {"config": {}, "class_name": 